asciiart-load-test.yml
config:
  target: "http://localhost:4000/"
  phases:
    - duration: 60
      arrivalRate: 25
 
scenarios:
  - name: "Emit an event"
    engine: socketio
    flow:
      - emit:
          channel: "hello"
          data: "Hello from Artillery"
        response:
          channel: "world"
          data: "Hello from Artillery"